{
    "Announcements": [
        {
            "Title": "Welcoming... <b><u>Anomaly</u></b>...",
            "Date": "12/16/2022",
            "Description": "<p>Welcome back to <b>Video Horror Stats</b> - today I have quite the update for you!</p><p>Today, we welcome in <b>Anomaly</b> as a new preview monster currently available in Private Screening.</p><p>Additionally, <b>Reggie</b> has been added, his full details are available in the Teens page alongside his journey being available in the Journeys page!</p><p>I'm working on the Weapons page primarily right now, but as it's exam season things are a little crazy! I'm glad I could push the new content out quite quick.</p><p>Enjoy the new content, and as per usual feel free to follow me on my <a href='https://twitter.com/shadersop'>Twitter</a> for more updates!</p><h3>Stay tuned, Horror Friends...</h3><h3>- Kyle</h3>"
        },
        {
            "Title": "A Quick Break!",
            "Date": "09/25/2022",
            "Description": "<p>So after the launch of Video Horror Stats I decided that would be a good time to take a quick break from the game. Included in this break was me halting any work on Video Horror Stats for that period of time.</p><p>This was mainly because to be totally honest, I was getting burned out! Best way to avoid this was to let the game go for a quick bit, and I'm feeling slightly better about it now (though, like most players, there are some things I worry about but I feel that's quite normal). As such this is moreso just a small announcement saying that I want to finish the work on the weapons page and the Creator Hub. This process <span style='font-weight:400;'>will</span> be slower as I have university, do freelancing, and work two jobs - but I do intend on getting it finished. Many thanks for the support everyone, I appreciate it so much! For further updates on Video Horror Stats feel free to follow me on my <a href='https://twitter.com/shadersop'>Twitter</a>!</p><h3>Stay tuned, Horror Friends...</h3><h3>- Kyle</h3>"
        },
        {
            "Title": "Welcome to Video Horror Stats!",
            "Date": "09/14/2022",
            "Description": "<p>At long last, welcome to the launch of Video Horror Stats! This has been a passion project of mine for months and it feels great to finally get it out into the world!</p><hr><p>Now - you might be wondering - <b>what exactly <i>IS</i> Video Horror Stats?</b> Well, let me explain!:</p><p>Video Horror Stats is a website designed first and foremost for players of Video Horror Society looking to up their game and dive deeper into the numbers that balance (or sometimes try their best to!) the game we all love and enjoy. I built a Google Docs document initially with SkelXton and Bjorksnase, however - I felt the document was never to the standard I wanted it to be - not because the document wasn't good, but because Google Docs was clearly not the right platform for this type of task. So, with that - <b>I set out to build my own website specifically for this purpose.</b></p><p>It's worth noting I already had web development and design knowledge prior to taking on this project - so I had a great start, but I learned a ton throughout the process. This site is built from scratch using Node.JS, Pug, and Express as the backend and normal, plain-jane HTML, CSS, and Javascript as the frontend.</p><p>I think it goes without saying this site is still incomplete. I will be working on it as well, adding weapons, more teen stats, maps .etc in the future - however in the meantime:</p><p>1. Track the development progress at the <a href='https://trello.com/b/uspug5y7/video-horror-stats'>Trello</a> page</p><p>2. Enjoy the site!</p><h3>Stay tuned, Horror Friends...</h3><h3>- Kyle</h3>"
        }
    ]
}